#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>

//算数操作符  +-*/
//移位操作符 位操作符
//赋值操作符
//单目操作符
//关系操作符
//逻辑
//条件
//逗号
//下表引用
//函数调用
//结构成员访问
// 
// 
//二进制和进制转换
// 1 1 1 1  1+2+4+8  二进制  0 1
//  8进制 0-7  1 7    7+8
//16进制   0 1 2 3 4 5 6 7 8 9 a b c d e f 
//数字以0开头，会被当成8进制  8 3个二进制即可  16  4个二进制   0x
//比如0x47 转二进制  0100 0111即可
// 
// 原码 反码 补码 
// 当我们要把一个数转换成二进制表示  整数的二进制有三种表现形式
//a = -10   1000000000000000000000000001010
//a = 10    0000000000000000000000000001010  共32位  正数 原码=补码=反码
//反码是原码符号位不变，其他取反
//反码+1为补码（二进制下）
//补码到原码  1.-1 取反  2.取反 +1
//整数在内存中存的是补码
//int main()
//{
//	//1-1
//	//1+(-1)
//	//用原码是错的  -2  
//	//-1的补码全1
//	//1和-1的补码会多一位，进的那一位在最左边，丢掉  -- 0
//	return 0;
//}

//移位操作符  <<左移  >>右移  对整数进行操作
//int main()
//{
//	int a = 10;    //0000000000000000000000000001010
//	int b = a << 1;  // 0000000000000000000000000010100  左移，左边的丢弃，右边补0   b=a向左 但是a不变  
//	printf("b = %d\n", b);      //        
//	printf("a = %d\n", a);
//	return 0;
//}

//int main()
//{
//	int a = -1;  //1000000000000000000000000000001    // 补码  11111111111111111111111111111
//	int b = a << 1;  // 111111111111111111110   //
//	printf("a = %d\n", a);   //-1
//	printf("b = %d\n", b);  // -2
//	return 0;
//}
////正整数可用原码  但是负整数要用补码来计算

//逻辑右移    左边补0 右边丢弃
//算数右移  左边原符号位 右边丢弃
//右移究竟采用何种方式取决于编译器，通常都是算术右移
//int main()
//{
//	int a = -10;
//	//1000000000000000000000000000001010原
//	//1111111111111111111111111111110101反
//	//1111111111111111111111111111110110补
//	//1111111111111111111111111111111011右移
//	//1000000000000000000000000000000100 反
//	//1000000000000000000000000000000101  原
//	int b = a >> 1;
//	printf("b = %d\n", b);    //-5          
//	printf("a = %d\n", a);
//	return 0;
//	
//}
//&按二进制与  |按二进制或     
// &&逻辑与  ||逻辑或   真假
//int main()
//{
//	int a = 6;
//	//00000000000000000000000000000110 原  
//	int b = -7;
//	//10000000000000000000000000000000000111
//	//11111111111111111111111111111111111000
//	//11111111111111111111111111111111111001  -7补码
// 
//	int c = a & b;// a和b 的补码的二进制位进行运算  与
//	//00000000000000000000000000001010
//	//111111111111111111111111111111001
//	//有0则为0 全为1才为1
//	
// int d = a | b;
// //00000000000000000000000000000110
//	//11111111111111111111111111111001
//	//有一则为1 同时为0才为0
// 
//	int e = a ^ b;  //按位异  the same  0    different 1
//	//对应的二进制位相同为0，相异为1
// 
//	//波浪号按位取反
//	printf(" % d \n", d);  //11111111111111111111111111111111补 // 100000000000000000000001原
//	return 0;
//}
//
//  不能创建临时变量  实现两个整数的交换
//int main()
//{
//	int a = 3;  // 00000000000000000000000000000011
//	int b = 5;  // 00000000000000000000000000000101
//	a = a ^ b;  // 0^a = a  a^a = 0      3^3^5 = 3^5^3 = 5  支持交换率  
//	b = a ^ b;   //a^b^b = a
//	a = a ^ b;    // a^a^b = b    相同为0相异为1 不会溢出
//	return 0;
//}

//编写代码，求一个整数存储在内存中二进制位的个数
//能不能拿到二进制的每一位，然后统计！  123   所以这个是统计1的个数
//123%10 = 3   123/10 = 12
//int count_bit_one(unsigned int n)
//{
//	int count = 0;
//	while (n)
//	{
//		if (n % 2 == 1)  //但是如果n = 8 呢
//		count++;                         // 位数可以用n/2  多弄几次  每一次出现的就是最后的位数
//		n = n / 2;
//	}
//	return count;
//}
//
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int ret = count_bit_one(num);
//	printf("%d\n", ret);
//	return 0;
//}

//1:   000000000000000000000000000000001     n:11111111111111111111111111111111111
//思路   n&1 ==1  n&1 ==0    可以知道n的最后一位是否为1  然后移动n 判断n的每一位
//count_bit_one(int n)
//{
//	int i = 0;
//	int count = 0;
//	for (i = 0; i < 32; i++)    // 32次
//	{
//		if ((n >> i) & 1 == 1)
//		{
//			count++;
//		}
//	}
//	return count;
//}
//
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);     
//	int ret = count_bit_one(num);
//	printf("%d\n", ret);
//	return 0;
//}

//判断一个数的二进制位里有几个1
//int count_num(int n)
//{
//	int count = 0;
//	int i = 0;
//	for (i = 0; i <= 31; i++)
//	{
//		if ((n>>i) & 1 == 1)
//		{
//			count++;
//		}
//	}
//	return count;
//}
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int ret = count_num(num);
//	printf("%d\n", ret);
//	return 0;
//}

//n = 11                   1011
//n-1      1010
//n = n&n-1                 1010
// n-1         1001
//n=n&n-1                  1000
//n - 1       0111
//n=n&n-1                   0000
//没执行一次会去掉一个1   n = n&(n-1)     //去掉最右边的1
//n = 1010
//n-1 = 1001
//n&(n-1)= 1000
//count_bit_one(int n)   //有几个1循环几次  牛
//{
//	int i = 0;
//	int count = 0;
//	while (n)
//	{
//		n = n & (n - 1);  // 按位与
//		count++;
//	}
//	return count;
//}
//
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int ret = count_bit_one(num);
//	printf("%d\n", ret);
//	return 0;
//}
// 
// 进阶版求几个1
//int count_num(int num)
//{
//	int count = 0;
//	while (num)
//	{
//		num = num& (num - 1);
//
//		count++;
//
//	}
//	return count;
//
//}
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//	int ret = count_num(num);
//	printf("%d", ret);
//	return 0;
//}
//写一个代码判断n 是否为2的次方数  只能有一个1             
//思考;    n<0  都不是 n>0时
//{
//	int num = 0;
//	scanf("%d", &num);
//	int count = 0;
//	
//	while (num)
//	{
//		num = num & (num - 1);   //if(n&(n-1)==0)
//		count++;
//	}
//	if (count == 1)
//		printf("这个数是2的次方数");
//	else
//		printf("这个数不是2的次方数");
//	return 0;
//
//	
//	       //0001    0010  0100  只有一个1
//	
//
//}

//二进制位置置0或置1
//编写代码将13二进制序列的第5位修改为1，再改为0
//int main()
//{
//	int a = 13;
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000
//	a = a | 16;
//	//00000000000000000000000000011101
//	//11111111111111111111111111101111
//	
//
//	return 0;
//}
//  现在让我们进行推广
//如果要将第n为修改为1 那么让第n位的二进制为1 再或  修改为0 就改为0 再或
//则对于任意一个数  //2的n次方怎么求呢    
//int main()
//{
//	int num = 0;
//	scanf("%d ", &num);
//	num = num |                                       // 本人思路  瑕疵  麻烦
//}

//int main()
//{
//	int a = 13;
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000
//	//00000000000000000000000000000001  (按位取反）
//	//11111111111111111111111111101111  &这个即可 变为0
//	int n = 5;
//	a = a | (1 << (n - 1));    //现在已经修改为1           //关键  移动  ~按位取反  再&即可
//	printf("%d\n", a);
//	a &= ~(a << (n - 1));                     //现在已经修改为0
//	printf("%d\n", a);
//	return 0;
//}
//譬如先把我13的n位变成1，再变成0
//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int num = 13;
//	num |= 1 << (n - 1);   //变为1                        00000000011100000000110111
//	num&= ~(1 << (n - 1));  //变为0                     00000000000000000000000001
//	                                                   //00000000000000000000001000
//	return 0;                                          //00000000011100000000111111
//	                                                   //00000111000000001111110000
//	//                                                   11111000111111110000001111
//}
//**************************************************************
//单目操作符
//&--取地址操作符  *--解引用操作
//  a & b   -- 按位与    int a = 0;  &a;  取地址   指针再讲

//逗号表达式
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int c = (a > b, a = b + 10, a, b = a + 1);//(逗号表达式）  从左向右依次计算
//	printf("%d\n", c);  //13
//	return 0;
//}
// while (a = get_val(), count_val(a), a > 0)
//{
//	 //业务处理
//}
//                           //上面的更好  以最后的进行判定
// int main()
// {
//	 a = get_val();
//	 count_val(a);
//	 while (a > 0)
//	 {
//		 //业务处理
//		 a = get_val();
//		 count_val(a);
//	 }
//	 return 0;
// }

//下标访问[]  函数调用（）
//int main()
//{
//	int arr[10] = { 1,2,3,4,5 };
//	int m = arr[4];  // 数组中下标为4的元素
//	//[]下标引用操作符    操作数  arr,4
//	// 3 + 5  3和5是操作数
//	//
//	printf("%d\n", m);
//	return 0;
//}
//int Add(int x, int y)
//{
//	return x + y;
//}
//int main()
//{
//	printf("he he\n"); 
//	//()函数调用操作符
//	int ret = Add(3, 5);    //操作数  Add 3 5
//	//函数调用操作符最少有几个操作数？ 1个  print();
//	return 0;
//}
//
//

//结构成员访问操作符
//数组是相同元素的集合
//struct  - 结构体关键字
//	tag  - 自定义 标签引用
//struct tag
//{
//	member - list;  成员列表  最少有一个
//} varible - list;  变量列表
//学生类型
//struct Student
//{
//	char name[20];
//	int age;             // 每一个都是成员变量，组成成员列表
//	float score;
//}s4,s5,s6;  //  变量列表 全局变量
//struct Student s3;  //全局变量
//
//struct Point
//{
//	int x;
//	int y;
//};
//
//
//struct S
//{
//	char ch;
//	struct Point p;
//	int arr[10];
//	double d;
//};
//
//
//int main()
//{
//	int a;
//	struct Student s1 = {"翠花",20,98.0};//局部变量
//	struct Student s2 = {"旺财",18,69.8};
//	struct S s = { 'a',{4,5},{1,2,3},3.14 };
//	struct Point p = { 10,20 };
//	printf("%c\n", s. ch);
//	printf("坐标是%d %d\n", s.p.x, s.p.y);
//	printf("%d\n", s.arr[0]);
//	printf("%lf\n", s.d);
//	return 0;
//}
//


//结构体成员访问操作符
//结构体变量.结构体成员名
//相邻操作符考虑优先级
//相邻操作符的优先级相同的情况下，结合性说了算
//当我们明确了优先级和结合性，那是否就能确定表达式的值呢
//表达式求值
//int main()
//{
//	//int a = 10;
//	//int b = 20;
//	//int c = a + b;
//	//  字符或短整型再使用之前会被转换为普通整形，这种转换称为整形提升(cpu中的ALu 操作数字节长度一般是int 类型)
//	//  char 类型  -128~127
//	char a = 20;
//	//00000000000000000000000000010100
//	//  00010100   ------a                 char是1字节  8个二进制位  然后进行整型提升,a的补码就是a(因为符号0位正）
//                                          b 要取补码（b的符号位1为负)
//	char b = 130;
//	//00000000000000000000000010000010
//	//  10000010  --------b
//
//	//char 是字符类型   int 默认有符号整形
//	//  char是否是signed char  是取决于编译器的
//	//  vs 上 char  等价于signed char
//	//000000000000000000000000000000010100   -----a
//	//111111111111111111111111111110000010  -----b
//	//111111111111111111111111111110010110补码        10010110---c      
//	// 11111111111111111111111111110010110
//	// 10000000000000000000000000001101001
//	//100000000000000000000000000001101010原码
//	char c = a + b;
//	printf("%d\n", c);
//	return 0;
//}
////提升的过程中,有符号的高位补符号位，无符号的高位补0

//算数转换


//a*b + c*d + e*f
//1   2  3   4  5
//1   3   5   2  4
//1   3   2   5  4
//可能产生不同的结果
//int main()
//{
//	int i = 10;
//	i = i-- - --i * (i = -3) * i++ + ++i;
//	printf("i = %d\n", i);
//	return 0;
//}
//
//   猪队友
//int fun()
//{
//	static int count = 1;
//	return ++count;
//
//}
//int main()
//{
//	int answer;
//	// 2 3 4
//	answer = fun() -  fun() * fun();
//	printf("%d\n", answer);   //输出多少  //多种可能性
//	return 0;
//}
//

//int main()
//{
//	int i = 1;
//	int ret = (++i) + (++i) + (++i);  //前置++优先级大于（）  
//	printf("%d\n", ret);
//	printf("%d\n", i);
//	return 0;
//}
//	
